Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ཨ་པྲ་ཀམ་པྱ། བ་ཧུ་ས་ཏྭ།
en: You mature the mindstream of beings, you purify all their karmic obscurations, you release them from all disease, and you fulfill all their wishes.

source: སནྟ་ཏི། པ་རི་པཱ་ཙ་ཀ་མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ། སརྦ་ཀརྨ་ཨཱ་བ་ར་ཎ་བི་ཤོ་དྷ་ཀ།
en: O comforter of all beings, homage be to you, svāhā! [

source: སརྦ་བྱཱ་དྷི་པ་རི་མོ་ཙ་ཀ། སརྦ་ཨཱ་ཤཱ་པ་རི་པཱུ་ར་ཀ། སརྦ་ས་ཏྭ། ས་མཱ་ཤྭཱ་ས་ན་ཀ་ར།
en: 311] “Oṁ, O wearer of the garb of Brahmā, dhara dhara, dhiri dhiri, dhuru dhuru!

source: ན་མོ་སྟུ་ཏེ་སྭཱ་ཧཱ། ཨོྃ་བྲཧྨ། བེ་ཥ་དྷ་ར།
en: You radiate amogha light all around, hūṁ! [

source: ས་མནྟ། ཛྭ་ལ་ཨ་མོ་གྷ་ཧཱུྃ། དོན་ཡོད་པའི་སྙིང་པོ། ཨ་ཡི་གེ་གཅིག་པོ་ནི་ཀུན་ནས་གསང་བ་དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་དམ་ཚིག་དང་། པདྨ་ཡངས་པའི་དཀྱིལ་འཁོར་དུ་ཞུགས་པ་རིགས་ཐམས་ཅད་ཀྱི་སྤྱིའི་ཡིན་ཏེ།
en: With this one syllable, the vidyā holder enters the great lotus maṇḍala and the secret samaya bond with the all-inclusive tathāgata family.

source: བཀླགས་པས་གྲུབ་པའོ།
en: By reciting it, he will realize the sameness of all the families.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་སྙིང་པོ་ཡི་གེ་གཅིག་པོ་ཀུན་ནས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་གསང་བ་སྤྱིའི་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་སྨྲས་པ་ཙམ་གྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཤིང་ལྷའི་མེ་ཏོག་གི་ཆར་རབ་ཏུ་བབ་ལ། ཀུན་ནས་རིན་པོ་ཆེའི་ཆར་རབ་ཏུ་བབ་བོ།
en: As soon as Noble Avalokiteśvara, the great bodhisattva being, recited this single-syllable heart mantra—the secret maṇḍala of liberation shared by all the tathāgatas of all the families—the entire trichiliocosm with its world spheres shook in six different ways, and a rain of divine flowers and jewels fell everywhere.

source: །དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཀུན་ནས་གཤེགས་ནས་ནམ་མཁའི་དཀྱིལ་ལ་རྫུ་འཕྲུལ་གྱིས་བཞུགས་སོ།
en: Hundreds of thousands of millions of tathāgatas, as numerous as the grains of sand in ten million Gaṅgā rivers, remained suspended in space throughout the ten directions using their magical power.

source: །དོན་ཡོད་པའི་རིམ་པར་ཕྱེ་བའི་སྤྲིན་ལྷའི་རིན་པོ་ཆེ་སྣ་བདུན་ཕབ་ལ་འབབ་པས་ཁེབས་པ་དང་། ལྷའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མེ་ཏོག་རྣམས་དང་། ལྷའི་རྒྱན་དང་། གོས་སྣ་ཚོགས་པའི་ཆར་བཅོམ་ལྡན་འདས་དང་།
en: Across the sky they spread a veil of amogha clouds that was composed of the seven types of jewels, divine flowers made of the seven types of jewels, and various divine carpets and items of clothing.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དོན་ཡོད་པའི་རྒྱལ་པོའི་ཚུལ་དུ་ཞུགས་པ་ལ་མཆོད་པ་དང་། བཀུར་སྟི་བྱ་བའི་ཕྱིར་རབ་ཏུ་ཕབ་བོ།
en: They rained down these items as an act of worship, an offering to the Blessed One and to Noble Avalokiteśvara in his form of Amogharāja.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་འབྱིན་པར་མཛད་དེ།
en: These blessed buddhas uttered the following words of approval: “Good!

source: སེམས་དག་པ་ཆེན་པོ་ཁྱོད་ཀྱིས་སངས་རྒྱས་འབྱུང་བ་མཆོག་བསྟན་པ་ལེགས་སོ་ལེགས་སོ།
en: It is good, O great, pure being!

source: །འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་གསང་བའི་ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་དང་། རིག་སྔགས་ཀྱི་གནས་རིམ་པར་ཕྱེ་བ་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་དང་། ཡི་གེ་གཅིག་པའི་རྗེས་སུ་ཞུགས་པ་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་ཉི་མ་གཅིག་ཤར་བ་ཡིན་ནོ།
en: You have shown yourself to be a manifestation of the supreme buddha as, with this one syllable, you have pervaded the entire maṇḍala of liberation, that vast reserve of secret mudrās, maṇḍalas, and vidyās of the families of all tathāgatas, just like the single sun that rises in all the world spheres in the great trichiliocosm.

source: །གང་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རྡུལ་ཕྲ་མོ་སྙེད་ཀྱི་སངས་རྒྱས་འབྱུང་བ་རྫོགས་པར་སངས་རྒྱས་འབྱུང་བ་གཅིག་གིས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་པ་ཡིན་ཞིང་།
en: By communing only with you, a buddha, beings can commune with all the blessed buddhas appearing in the past, present, and future, as numerous as the atoms in the world spheres of the great trichiliocosm.

source: སྙིང་པོ་ཡི་གེ་གཅིག་གིས་རྗེས་སུ་ཞུགས་པ་ཡིན་ལ་ཕྱག་རྒྱ་དང་།
en: They can be reached with this one-syllable heart mantra, this singular convergence of the multitude of mudrās and maṇḍalas. “

source: དཀྱིལ་འཁོར་རིམ་པར་ཕྱེ་བ་དང་། དམ་ཚིག་གཅིག་གིས་རྗེས་སུ་ཞུགས་པ་ཡིན་ནོ། དོན་ཡོད་པའི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་དེ་བཞིན་གཤེགས་པའི་གསང་བ་བཟང་པོ་འདི་ནི་དོན་ཡོད་པའི་གསང་སྔགས་ཀྱི་ཞགས་པས་དྲངས་ཤིང་སྐུ་གཅིག་གི་དམ་ཚིག་ལ་བཀོད་པ་ཡིན་ཏེ། དེ་ནས་དོན་ཡོད་པའི་ཞགས་པ་ཞེས་བྱ་བར་བྱིན་གྱིས་བརླབས་སོ།
en: Using the noose of this amogha mantra—this maṇḍala of liberation that is a miraculous amogha creation and a secret ornament of the tathāgatas—all the blessed buddhas can be summoned and established in a single samaya form and consecrated in that form as Amoghapāśa.

source: སྙིང་པོ་ཡི་གེ་གཅིག་པའི་གཟུངས་སྔགས་ནི་རྟག་ཏུ་བཀླགས་པས་གྲུབ་པ།
en: The mantra formula of this one-syllable heart dhāraṇī is accomplished by being recited.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་ཡིན་ནོ།
en: They are blessed by all the tathāgatas.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ལེགས་སོ། །ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The blessed Tathāgata Śākyamuni applauded Avalokiteśvara, the great bodhisattva being, “Good!

source: སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ལེགས་སོ་ལེགས་སོ།
en: It is good, O most compassionate one!

source: །དེ་ཁོ་ན་ཉིད་བསྒྲུབ་པ་གྲུབ་པ། དེ་བཞིན་གཤེགས་པའི་རིགས་སྤྱིའི་དམ་ཚིག་ཐམས་ཅད་གྲུབ་པ།
en: This supremely auspicious mantra brings the realization of truth and carries the samaya for successfully realizing the sameness of all tathāgata families. This heart essence of Amoghapāśa brings accomplishment when recited.

source: དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བསྒྲུབ་པ་བཀླགས་པས་འགྲུབ་པ་འདི་ནི་མཆོག་ཏུ་བཟང་བ་ཡིན་གྱིས་ཡོན་ཏན་གྱི་ཕུང་པོ་ཤོད་ཅིག །སྙིང་པོ་ཡི་གེ་འདི་ནི་དོན་ཡོད་པའི་ཞགས་པ་སྒྲུབ་པའི་ཆོ་ག་བསྒྲུབ་པ་བདེ་བ། བཀླགས་པས་གྲུབ་པ་ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་དང་། སྐུ་གཟུགས་རི་མོ་དང་བཅས་པ་བསྒྲུབ་པའི་ཆོ་ག་བླ་ན་མེད་པ་ཡིན་ནོ།
en: Please teach this one-syllable heart mantra of Amoghapāśa, the receptacle of qualities, and the corresponding practice procedure—the supreme practice procedure, with its mudrās, maṇḍalas, and cloth painting, that can be swiftly accomplishment through recitation.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དོན་ཡོད་པའི་ཞགས་པ་པདྨ་ཡངས་པའི་དཀྱིལ་འཁོར་དང་།
en: Noble Avalokiteśvara, the great bodhisattva being, said to the Blessed One, “Please give your blessing, Lord, as I will now teach the required procedure.

source: པདྨའི་རིགས་ཀྱི་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་དང་། དེ་ཁོ་ན་ཉིད་ཀྱི་དམ་ཚིག་གསང་བ་ཆེན་པོ་དང་། རིགས་སྤྱིའི་སྒྲུབ་པ་བཀླགས་པས་འགྲུབ་པ་འདིའི་ཡོ་བྱད་དང་།
en: In the great lotus maṇḍala of Amoghapāśa, in the maṇḍala of liberation of the lotus family that constitutes the heart essence of the great samaya of the secret nature, it is recitation that brings the accomplishment that applies to all families.

source: ཆོ་ག་བཤད་པར་བགྱི་ཡིས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། བཅོམ་ལྡན་འདས་གང་གིས་དྲན་པ་ཙམ་གྱིས་བདག་མདུན་ན་ཉེ་བར་མཆིས་ཤིང་བསམ་པ་ཐམས་ཅད་ཡིད་བཞིན་དུ་ཡོངས་སུ་རྫོགས་པར་བགྱི།
en: Lord, once the recitation is accomplished, as soon as the mantra has been mindfully repeated, I will arrive in front of the vidyā holder, fulfill all his wishes and hopes, and grant him every boon.

source: རིག་སྔགས་ཀྱི་དངོས་གྲུབ་ཐམས་ཅད་རྗེས་སུ་སྩལ་བར་བགྱིའོ།
en: I will grant him the accomplishment of all vidyās.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed Śākyamuni replied, “Good!

source: སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལེགས་སོ་ལེགས་སོ།
en: It is good, Avalokiteśvara!

source: །དེ་ལྟར་ཁྱོད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་བསྒྲལ་བར་བྱ་ཞིང་།
en: In this way you will deliver all beings from saṃsāra and bring supreme accomplishment to vidyā holders.

source: རིག་སྔགས་འཆང་རྣམས་ཀྱི་དངོས་གྲུབ་དམ་པ་མཆོག་དེ་ཁྱོད་ཀྱིས་རབ་ཏུ་སྦྱིན་པར་གྱིས་ཤིག། །དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་གསང་བའི་དམ་ཚིག་དང་།
en: You should therefore give us this teaching, this secret heart essence of Amoghapāśa that has been blessed by the Tathāgata as his secret samaya.

source: ཡི་གེ་གཅིག་པོ་རིགས་སྤྱིའི་རྗེས་སུ་ཞུགས་པས་དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་བརླབས་ཀྱིས་ཡོ་བྱད་དང་།
en: This one syllable provides access to all the families equally.

source: སྒྲུབ་པའི་ཆོ་ག་ཤོད་ཅིག །
en: Please teach the practice procedures!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བཅོམ་ལྡན་འདས་ཀྱིས་དབུགས་ཕྱུང་བ་དག་ཐོས་ནས། སྙིང་ཤིན་ཏུ་དགའ་སྟེ། ཡོ་བྱད་དང་། ཆོ་ག་སྨྲས་པ།
en: Noble Avalokiteśvara, the great bodhisattva being, his heart filled with joy after hearing these words of encouragement from the Blessed One, taught the practice procedures.

source: བཅོམ་ལྡན་འདས་ཀྱིས་མངོན་སུམ་ཉིད་དུ་སྡིག་པ་བསྲེག་ཅིང་མ་ལུས་པར་ཟད་པར་བགྱིད་པ། སེམས་ཅན་དམྱལ་བ་རྩ་བ་ནས་འབྱིན་པའི་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་སྨྲས་པ།
en: He taught the complete set of procedures whereby the vidyā holder comes face-to-face with the Blessed Lord, burns all his wrongdoing, and completely exhausts the karma of falling into hell. “

source: དཀྱིལ་འཁོར་གྲུ་བཞིར་བྱས་ནས་སུ། །དབུས་སུ་པདྨའི་འཁོར་ལོ་བྱ། །ཚོན་རྩི་སྣ་ཚོགས་རྣམ་པར་དབྱེ། །པདྨ་ཟེ་བའི་དབུས་སུ་ནི། །སྤྱན་རས་གཟིགས་དབང་བཞུགས་པར་བྱ།
en: The vidyā holder should demarcate a square maṇḍala, draw a circular lotus inside it with the individual parts painted in different colors, and draw the Lokeśvara among the filaments of the lotus.

source: །བུམ་པ་བཀང་དང་འཕན་རྣམས་ཀྱིས། །དཀྱིལ་འཁོར་ཀུན་ནས་བརྒྱན་པར་བྱ། །མེ་ཏོག་སྣ་ཚོགས་ལེགས་པར་དགྲམ། །སྤོས་དྲི་བཟང་པོས་བསྒོས་པ་ཡི།
en: He should then adorn the circumference of the maṇḍala with full jars and banners, strew it with colorful flowers, and smear it with divine fragrances.

source: །མར་མེའི་ཕྲེང་བ་ཀུན་ཏུ་བྱེད། །མཆོད་ཡོན་ཆུ་དག་གཞག་པར་བྱ། །གུ་གུལ་དང་ནི་ས་ལ་ལ་ཀི། །ཨ་ག་རུ་དང་དུ་རུ་སྐ། །བདུག་སྤོས་སྣོད་བཞི་དག་ནས་བདུག །
en: He should arrange a circle of lamps, offer argha water for the feet, and burn incense of agarwood, bdellium, frankincense, and olibanum in four vessels. “

source: རིག་སྔགས་འཆང་བ་ཁྲུས་བྱས་ནས། །གོས་གཙང་བགོས་ཏེ་སྨྱུང་བ་ལ། །ཉེ་བར་གནས་ནས་ཚེས་བརྒྱད་དམ།
en: He should then bathe thoroughly, put on clean clothes, and observe a ritual fast.

source: །བཅུ་བཞིའམ་ཚེས་ནི་བཅྭ་ལྔ་སྟེ། །ཟླ་བ་ཡར་གྱི་ངོ་ལ་བསྒྲུབ། །ཤར་དུ་ཁ་བལྟས་འདུག་ནས་སུ། །དོན་ཡོད་ཞགས་པ་དུས་གསུམ་དུ། །ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱ། །སྙིང་པོའམ་བརྒྱ་རྩ་བརྒྱད་དུ་བཟླས།
en: His practice should commence on the eighth, fourteenth, or fifteenth day of the bright fortnight, at which time he should sit facing east and recite, at the three junctions of the day, the mantra of Amoghapāśa twenty-one times and the heart mantra one hundred and eight times.

source: །ཡི་གེ་གཅིག་པོ་འབུམ་དུ་ནི། །མཚན་མོ་བར་ཆད་མེད་པར་བཟླས།
en: After that, he should recite the one-syllable mantra one hundred thousand times without interruption throughout the night.

source: །སྐྱ་རེངས་ཤར་ནས་འཇིག་རྟེན་དབང་། །ཟེ་བའི་དབུས་ན་འབར་འགྱུར་ཞིང་། །འབུལ་འགྱུར་འགུལ་བ་དེ་ཡིས་ནི།
en: At the break of dawn, the Lokeśvara, seated among the lotus filaments, will blaze with light, and the earth will quake.

source: །དམྱལ་བ་ཆེན་པོ་བཅུ་དྲུག་གི། །སྒོ་རྣམས་དག་ནི་བྱེ་བར་འགྱུར། །དམྱལ་བའི་གནས་ནས་ཤུགས་ཆེན་གྱིས། །གཡོ་ལ་གཡོས་པ་ཙམ་དེས་ནི། །དམྱལ་བའི་ཚོར་ཀུན་རྣམ་པར་འཇིག །
en: With this quaking, the gates of the sixteen hells will fall open, and the dwellings there will sway violently.

source: དམྱལ་བ་དེ་ཡང་རྣམ་པར་འཇོམས།
en: As soon as they begin to sway, the pain of the hell beings will cease, and the hell realms themselves will be destroyed.

source: །སེམས་ཅན་དམྱལ་བ་དེ་དག་ནི། །ཐར་ནས་ཕྱོགས་བཅུར་བརྒྱུག་པ་ཡི།
en: The inhabitants of hell will be released and will disperse in the ten directions.

source: །དམྱལ་བའི་སྡུག་བསྔལ་ཀུན་ལས་གྲོལ། །མཐོ་རིས་ལམ་དུ་ཞུགས་པར་འགྱུར།
en: Completely free from all the sufferings of hell, these beings will follow the road to heaven. “

source: །དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་དུ་དུད་འགྲོ་རྣམས་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར།
en: They will likewise be saved from the suffering of animal birth and from the condition of being an animal.

source: བདག་ཉིད་ཀྱི་སྒྲིབ་པ་དང་། སྡིག་པ་དང་། སྡུག་བསྔལ་མི་བཟད་པ་ཐམས་ཅད་མཐར་གདུགས་པར་ཡོངས་སུ་ཟད་པར་འགྱུར།
en: All the terrible sufferings they experience due to their personal obscurations and evil will diminish and be completely exhausted.

source: འཁོར་བའི་སྡུག་བསྔལ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ།
en: They will be saved from all the sufferings of the cycle of existence.

source: །གལ་ཏེ་སྡིག་པ་ཐམས་ཅད་ཟད་པར་གྱུར་ན། དེའི་ཚེ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྐུ་མདོག་གསེར་གྱི་མདོག་ཅན་དུ་སྟོན་པར་མཛད་ལ་མཆོག་ཐམས་ཅད་སྦྱིན་པར་མཛད་དོ།
en: When all their evil is completely exhausted, Noble Avalokiteśvara will appear to them in a golden body and grant them every boon.

source: །དོན་ཡོད་པ་དྲི་མ་མེད་པའི་ཡེ་ཤེས་རྒྱ་མཚོ་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར།
en: They will obtain the samādhi called the ocean-like display of the stainless amogha knowledge.

source: སྒྲིབ་པ་དང་བྲལ་བ་སེམས་ཀྱི་རྒྱན་རྣམ་པར་དག་པའི་བདག་ཉིད་ཀྱི་ངོ་བོ་ཐོབ་པར་འགྱུར།
en: With their obscurations gone, they will become pure beings adorned with pure thoughts. “

source: དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་པོ་རྣམས་མོད་ཉིད་ལ་མངོན་སུམ་དུ་སྟོན་པར་མཛད་ལ།
en: Hundreds of thousands of millions of billions of tathāgatas, as numerous as the grains of sand in ninety-nine Gaṅgā rivers, will appear to the vidyā holder face-to-face.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཕྱག་གཡས་པ་མགོའི་སྤྱི་བོར་འཇོག་པར་མཛད།
en: All these tathāgatas will extend their right arm and place their hand on his head.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར། །དགེ་བའི་རྩ་བ་ཆེན་པོ་ཡོངས་སུ་གཟུང་བར་འགྱུར།
en: He will thus obtain a great heap of merit and plant roots of great virtue.

source: འཇིག་རྟེན་པ་ཀུན་གྱིས་གཅིག་པུ་མཆོད་པ་ཆེན་པོ་བྱས་པར་འགྱུར། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་དང་། ཟླ་བ་དང་།
en: He alone will be worshiped by all people.

source: ཉི་མ་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་རང་གི་གཟུགས་ཀྱིས་མངོན་སུམ་དུ་སྟོན་ཅིང་ཉེ་འཁོར་ལ་ཀུན་ནས་སྲུང་བ་དང་། སྐྱོབ་པ་དང་།
en: Yama, Varuṇa, Kubera, Candra, Sūrya, Brahmā, Viṣṇu, and Maheśvara will directly appear to him in their own forms to attend upon him and will stand by him in order to guard, protect, and defend him in every way.

source: སྦེད་པ་བྱེད་པར་འགྱུར། དངོས་གྲུབ་དང་། དགོས་པ་ཐམས་ཅད་གྲུབ་པར་འགྱུར།
en: They will successfully perform whatever tasks he needs performed. “

source: གལ་ཏེ་སྡིག་པ་ཐམས་ཅད་ཟད་པར་མ་གྱུར་ན། དེའི་ཚེ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྐུ་མདོག་གསེར་གྱི་ཁ་དོག་ཅན་དུ་མི་མཐོང་དེས་སྒྲིབ་པ་དང་།
en: If the evil of the vidyā holder has not been completely eradicated, he will not be able to perceive the golden body of Noble Avalokiteśvara.

source: སྡིག་པ་ལྷག་མ་ལུས་པར་ཤེས་པར་བྱ་སྟེ།
en: This will serve as an indication that a residue of obscurations and evil still remains.

source: དེ་ཉིད་དུ་བཟླས་བརྗོད་ཀྱི་ཆོ་ག་སྨྱུང་བ་གཉིས་པ་བྱས་པ་དང་།
en: In such an event, he should perform the recitation procedure for a second time while observing the fast.

source: སྡིག་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་རྩ་བ་དང་བཅས་པ་ཐམས་ཅད་ཕྱུང་བར་འགྱུར་རོ།
en: This will remove all his evil and obscurations, together with their roots, so that they disappear.

source: །གལ་ཏེ་བཟླས་བརྗོད་ཀྱི་ཆོ་ག་སྨྱུང་བ་གསུམ་པ་བྱེད་ན་བཟླས་བརྗོད་ཀྱི་ཆོ་ག་གསུམ་རྫོགས་པ་དང་།
en: If the vidyā holder performs the recitation procedure for a third time while observing the fast, Noble Avalokiteśvara will extend his right arm and instantly transfer the vidyā holder to the realm of Sukhāvatī, as soon as the procedure is complete.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་ཕྱག་གཡས་པ་བརྐྱང་ནས་རིག་སྔགས་འཆང་བཏེག་སྟེ་མོད་ལ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་འོད་དཔག་མེད་ཀྱི་སྤྱན་སྔར་འཇོག་པར་མཛད་ལ་མངོན་སུམ་དུ་བཞུགས་སོ།
en: He will place him directly in front of Amitābha, where he will remain.

source: །དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་ཀྱིས་དབུགས་འབྱིན་པར་མཛད་ཅིང་ཕྱག་སྤྱི་བོར་འཇོག་པར་མཛད་དེ། ཚེ་དཔག་ཏུ་མེད་པར་འགྱུར་རོ། གལ་ཏེ་སེམས་ཅན་གཞན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། སྐྱེས་པའམ།
en: The Tathāgata Amitāyus will comfort him by placing his hand on his head, and his lifespan will become infinite. “

source: བུད་མེད་དམ། ཁྱེའུའམ། བུ་མོའམ། ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བ་གང་ཞིག་སྡིག་པ་དང་། སྒྲིབ་པ་ཟད་པར་འདོད་ན་རིག་སྔགས་འཆང་ཁྲུས་བྱས་ལ་གོས་གཙང་མ་བགོས།
en: If any other being—be they a son or a daughter of good family, a monk or a brahmin, a woman, man, boy, or girl, or even an animal—wants their evil and obscurations to disappear, such a vidyā holder should bathe thoroughly, wear clean clothes, and observe a ritual fast.

source: སྨྱུང་བ་བྱས་པ་དེས་དཀྱིལ་འཁོར་ལ་མངོན་དུ་ཕྱོགས་པར་བཞག་ལ། རིག་སྔགས་འཆང་ཆོ་ག་བྱེད་པས་གསང་སྔགས་རྗེས་སུ་དྲན་པར་བྱས་ནས་རྨ་བྱའི་སྒྲོས་བྱབ་པར་བྱའོ།
en: They should position themself facing the maṇḍala and mindfully repeat the mantra according to procedure.

source: དེ་ཙམ་གྱིས་ཡོན་ཏན་གྱི་ཁྱད་པར་ཐོབ་པར་འགྱུར་ཏེ།
en: They should brush with a peacock feather, and in doing so they will attain special qualities.

source: སྡིག་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་ཟད་པར་འགྱུར། ནད་ཐམས་ཅད་དང་། གདུག་པ་ཐམས་ཅད་དང་། །ན་བ་ཐམས་ཅད་དང་།
en: All their evil and obscurations will be purified, and their diseases, impurities, and acts of immediate retribution will become exhausted; there is no doubt about this.

source: མཚམས་མེད་པ་ཐམས་ཅད་ཟད་པར་འགྱུར་ཏེ། ཐེ་ཚོམ་མེད་དོ། །སྒྲིབ་པ་དང་བྲལ་བ་ཉིད་ཐོབ་པར་འགྱུར་ཞིང་ཚིག་གཟུང་བར་འོས་པར་འགྱུར།
en: They will thus obtain the state without any obscurations. “

source: ལྷ་ཐམས་ཅད་ཀྱིས་གཟུང་ཞིང་ཀུན་ནས་བསྲུང་བར་འགྱུར། དེ་བཞིན་གཤེགས་པའི་གསུང་ཐོབ་པར་འགྱུར།
en: Their speech will become pleasant, and all deities will look upon them with kindness and protect them.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གཟིགས་བཞེད་པར་འགྱུར།
en: All the tathāgatas will speak to them, and Noble Avalokiteśvara will appear to them willingly.

source: ཚེ་རིང་བ་དང་། སྒྲིབ་པ་དང་། ནད་དང་བྲལ་བར་འགྱུར།
en: They will live long and be free from any obscurations and diseases.

source: ཚེ་འཕོས་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར། ཚེ་རབས་སུ་ཚེ་རབས་དྲན་པར་འགྱུར། དགེ་བའི་རྩ་བ་བསོད་ནམས་ཀྱི་ཚོགས་ཐམས་ཅད་དང་ལྡན་པར་འགྱུར་ཏེ།
en: When they depart from this world, they will be reborn in the realm of Sukhāvatī, be able to remember their successive lives, plant the roots of virtue, and complete their accumulation of merit.

source: སྙིང་རྗེ་དང་། བྱམས་པ་ཆེན་པོ་ཡིད་ལ་བྱ་བ་རྩེ་གཅིག་ཏུ་བྱ་ཞིང་སྨྱུང་བ་དང་།
en: They will develop a one-pointed focus on great compassion and loving kindness.

source: བཟླས་བརྗོད་བྱའོ།
en: This recitation should be performed in combination with the ritual fast. “

source: །སྡིག་པ་དང་སྒྲིབ་པ་ཟད་པར་བྱ་བའི་དཀྱིལ་འཁོར་ཆེན་པོའི་ཆོ་གའོ།། །།འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ། །བམ་པོ་བཅུ་བདུན་པ།
en: This concludes the instructions on the great maṇḍala whereby evil and obscurations are exhausted. “

source: དེ་ནས་རྟག་ཏུ་བཟླས་པའི་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་བཤད་པར་བྱ་སྟེ།
en: Now I will teach a maṇḍala procedure for continuous recitation practice. “

source: དཀྱིལ་འཁོར་གྱི་ཚད་ཇི་ལྟ་བ་བཞིན་དུ།
en: The vidyā holder should demarcate a maṇḍala according to the right measure.

source: ལེགས་པར་ཕྱེ་བ། གྲུ་བཞི་པ། རྒྱར་གཟིངས་ཀྱི་ཚད་ཀྱིས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་བྱ་སྟེ། དྲིའི་ཚོན་རྩི་རྣམ་པར་བཀྲ་བ་ཀུན་ནས་པདྨའི་ཕྲེང་བ་དང་།
en: It should be four sided and well proportioned, with a total area the size of a boat, and have sections clearly marked with perfumed paints.

source: རྡོ་རྗེའི་གེ་སར་ལ་བརྟེན་པའི་དབུས་སུ་པདྨ་བྱའོ།
en: The vidyā holder should draw around it a row of lotuses that have filaments nestled within them.

source: །རྡོ་རྗེའི་ཐིག་སྐུད་ཀྱིས་ཀུན་ནས་བསྐོར་བའི་དབུས་ཀྱི་པདྨའི་གེ་སར་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཚངས་པའི་ཆ་བྱད་འཛིན་པ་དོག་པར་བྱའོ།
en: In the center, he should draw a lotus surrounded by a diamond thread, and upon its anthers, Noble Avalokiteśvara in the guise of Brahmā.

source: །ཉི་མ་རེ་རེ་ཞིང་མེ་ཏོག་དང་བདུག་པ་དབུལ་བར་བྱ་ཞིང་ཉི་མ་རེ་རེ་ཞིང་ཨ་ག་རུའི་བདུག་པ་དང་།
en: He should offer flowers and incense to him every day and burn incense of agarwood.

source: ཁྲུས་བྱས་གོས་གཙང་མ་བགོས་ཏེ། དོན་ཡོད་རྒྱལ་པོའི་བཟླས་བརྗོད་དང་། ཕྱག་རྒྱ་བཅིང་བར་བྱའོ།
en: Thoroughly bathed, ritually pure, and wearing clean clothes, he should recite the Amogharāja while displaying the mudrā.

source: །ཡི་གེ་གཅིག་པའི་སྙིང་པོའི་བཟླས་བརྗོད་ཐུན་གསུམ་དུ་ལན་གསུམ་མམ། ལན་བདུན་ནམ། ལན་ཉི་ཤུ་རྩ་གཅིག་ཏུ་བཟླས་སོ།
en: He should recite the one-syllable heart mantra three times, seven times, or twenty-one times at the three junctions of the day.

source: །ཟས་ངན་པ་བཅུ་ཡོངས་སུ་སྤང་བར་བྱ་ཞིང་། སེམས་ཅན་ངན་པ་ཡང་སྤང་བར་བྱའོ།
en: He should avoid the ten impure foods and crooked beings. “

source: །སྒྲུབ་ཐབས་ཀྱི་དེ་ཁོ་ན་ཉིད་ལས་ཐམས་ཅད་དུ་འཇིག་རྟེན་པའི་བྱ་བ་ཐམས་ཅད་འགྲུབ་བོ།
en: If the vidyā holder performs the practice correctly in every respect, all his worldly tasks will be successfully accomplished.

source: །འཇིགས་པ་ཆེན་པོ་མི་བཟད་པ་བརྒྱད་པོ་དེ་རྣམས་ལས་གྲོལ་ལོ། །དོན་ཡོད་པའི་རྒྱལ་པོ་དྲན་པས་ནད་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བྱེད་དོ། །དུག་དང་སྦྱར་དུག་དང་། བྱད་སྟེམས་དང་། གདོན་ཐམས་ཅད་དང་། འཇིགས་པ་དང་། སྡང་བ་དང་།
en: If he mindfully repeats the Amogharāja, he will be free from the eight great terrible fears, and all his diseases will disappear, as will every danger, fear, and terror of poison, venom, kākhordas, or grahas.

source: སྐྲག་པ་དང་། རིམས་དང་། ནད་ཐམས་ཅད་དང་། ཕོལ་མིག་དང་། ལྷོག་པ་དང་། མཚན་པར་རྡོལ་བ་དང་། གཡན་པ་དང་། རྐང་ཤུ་དང་། མཛེ་དང་། མགོ་བོ་ན་བ་དང་། མིག་ན་བ་དང་། རྣ་བ་ན་བ་དང་། སྣ་ན་བ་དང་། ཁ་ན་བ་དང་། རྐན་ན་བ་དང་། མགུལ་ན་བ་དང་། སྙིང་ན་བ་དང་། ལྟོ་ན་བ་དང་། སོ་དང་མཆུ་ན་བ་དང་། ལག་པ་ན་བ་དང་། རྩིབ་ལོགས་ན་བ་དང་། ཆུ་སོན་བ་དང་། ཕོ་བའི་ནད་དང་། མ་ཞུ་བ་དང་། རྐང་པ་ན་བ་དང་། རྒྱབ་ན་བ་དང་། ཡན་ལག་དང་། ཉིང་ལག་ཐམས་ཅད་ན་བ་དང་། ཚད་པ་དང་།
en: Mindfully repeating the mantra once while rubbing the afflicted area will dispel all his fevers and diseases, as well as all boils, ulcers, festering abscesses, skin eruptions, lesions, pustules, leprosy, scabs, headache, eye pain, earache, sinusitis, diseases of the mouth, pain in the palate, diseases of the neck and throat, asthma attacks, heart diseases, stomachache, toothache, pain of the lips, pain in the hands, pain in the flanks, bladder pain, gall bladder pain, constipation, pain in the feet, backache, pain in any major or minor limb, dysentery, hemorrhoids, diabetes, uncontrollable purging, and decrepitude.

source: གཞང་ནད་དང་། གཅིན་ནད་དང་། གསུད་པ་དང་། འཁོགས་པ་ལ་ལན་ཅིག་བརྗོད་དེ་བྱས་པ་ཙམ་གྱིས་ཐམས་ཅད་སེལ་བར་བྱེད་དེ། མྱུར་དུ་རབ་ཏུ་ཞི་བར་བྱེད་ཅིང་སྐད་ཅིག་དེ་ཉིད་ལ་ཡང་ཡང་དག་པར་གནས་པར་བྱེད་དོ།
en: They will be swiftly pacified and instantly removed.

source: །འཇིག་རྟེན་པའི་བྱ་བ་གཞན་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: All supramundane tasks will be accomplished as well. “

source: །དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུའི་དགེ་བའི་རྩ་བ་ཉི་མ་རེ་རེ་ཞིང་བསྐྱེད་པར་འགྱུར་རོ། །བསོད་ནམས་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ།
en: Every day the vidyā holder will plant the roots of virtue and accumulate great merit, as if he were in the presence of ninety-nine hundred thousand million billion tathāgatas.

source: །ཚིག་བཙུན་བར་ཡང་འགྱུར་རོ། །འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་བླ་མར་ཡང་འགྱུར་རོ།
en: His speech will be credible, and he will become the sole teacher of the entire world.

source: །མཆོད་པའི་འོས་ཆེན་པོར་འགྱུར་རོ། །དོན་ཆེ་ཞིང་ཆེ་བ་དག་འོང་བར་འགྱུར་རོ། །དབང་ཕྱུག་དང་།
en: He will be worthy of, and receive, many offerings and acquire great wealth.

source: དཔོན་པོ་ལྷུན་གྱིས་གྲུབ་པ་ཉིད་དུ་རྙེད་དོ། །རྒྱལ་པོ་དང་། བཙུན་མོའི་འཁོར་དང་། གཡོག་ཏུ་བཅས་པས་གཅིག་ཏུ་མཆོད་པར་འོས་པར་འགྱུར་རོ།
en: Without any effort on his part, he will obtain great power and influence and receive offerings from the king and his harem. “

source: །ཉི་མ་རེ་རེ་ཞིང་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མཐོང་བར་འགྱུར་རོ། །རྟག་ཏུ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཐོང་བ་སོ་སོར་ཐོབ་བོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་པར་བརྒྱན་པ་མཐོང་ངོ་།
en: He will behold Noble Avalokiteśvara every single day and be able to see, at all times, the bodies of the tathāgatas and buddha fields with their adornments.
